In [1]:
import pandas as pd
import numpy as np
data= {'A':[1,2,3,4],'B':[5,6,7,8],'C':[9,10,11,12]}
df = pd.DataFrame(data)

In [2]:
df['E']=[1,11,1111,1111]

In [3]:
df

   A  B   C     D
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111

In [7]:
df.loc[4]= [1,2,3,4]

In [8]:
df

   A  B   C     D
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111
4  1  2   3     4

In [10]:
df.rename(columns = {'D':'E'})

   A  B   C     E
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111
4  1  2   3     4

In [13]:
df.rename(index={4:5})

   A  B   C     D
0  1  5   9     1
1  2  6  10    11
2  3  7  11  1111
3  4  8  12  1111
5  1  2   3     4

In [16]:
df = pd.DataFrame({'A':["AAA","bbb","Abc"],'B':["AAA","BBB","CCC"]})

In [20]:
df['A'].str.islower().sum()

1

In [21]:
df1 = pd.DataFrame({'Name':["Arun Chauhan","Ram Kumar"," Shyam Singh"],'Score':[12,15,18]})

In [23]:
df1[["F_name","L_name"]] = df1["Name"].str.split(expand = True)

In [24]:
df1

           Name  Score F_name   L_name
0  Arun Chauhan     12   Arun  Chauhan
1     Ram Kumar     15    Ram    Kumar
2   Shyam Singh     18  Shyam    Singh

In [27]:
import pandas as pd

# Create a sample DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35]}

df = pd.DataFrame(data)

In [28]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [31]:
for index,row in df.iterrows():
    print(index,row['Name'])

0 Alice
1 Bob
2 Charlie

In [ ]:
3